def h(n,f,t,a):
 if n==1:print(f,t);return
 h(n-1,f,a,t);print(f,t);h(n-1,a,t,f)
n=int(input());print(2**n-1);h(n,1,3,2)
"""
h(n개의원반,시작위치,목적위치,보조위치)
h(3,1,3,2)라 하면, 3개의원반을 1번에서 3번으로옮기는데, 2번이 
보조위치가 된다.
2,1,3,2로 시작할시,
1,1,2,3 호출-(1,2출력),(1,3출력),1,2,3,1호출-(2,3출력)
즉,1을 기둥2로, 2를 기둥3으로, 1을 다시 기둥3으로

h(3,1,3,2)
 h(2,1,2,3)
  h(1,1,3,2)
  h(1,3,2,1)
 h(2,2,3,1)
  h(1,2,1,3)
  h(1,1,3,2)

h(4,1,3,2)
 h(3,1,2,3)
  h(2,1,3,2)
   h(1,1,2,3)
   h(1,2,3,1)
  h(2,3,2,1)
   h(1,3,1,2)
   h(1,1,2,3)
 h(3,2,3,1)
  h(2,2,1,3)
   h(1,2,3,1)
   h(1,3,1,2)
  h(2,1,3,2)
   h(1,1,2,3)
   h(1,2,3,1)

"""